{
  "titulo": "Projects",
  "proyectosLista": [
    {
      "titulo": "Personal Portfolio",
      "descripcion": "This portfolio is a project in itself. Depending on where you access it from, the context adapts the experience to offer a different proposal for each user. Try it out using the links below and click on them to see how it behaves based on the source.",
      "lista": [
        "Language context.",
        "Theme context.",
        "Content adapts depending on the time of day.",
        "PHP for basic forms.",
        "Use of PrimeReact, PrimeCSS, and PrimeIcons libraries."
      ],
      "seguimiento": "Just getting started.",
      "actualidad": "There’s always something new to add.",
      "links": [
        {
          "url": "https://sabatie.com.ar/",
          "texto": "Default from URL"
        },
        {
          "url": "https://sabatie.com.ar/?source=linkedin",
          "texto": "From a formal website"
        },
        {
          "url": "https://sabatie.com.ar/?source=facebook",
          "texto": "From a social network"
        }
      ],
      "imagen": "./images/portfolio.webp"
    },
    {
      "id": "2",
      "titulo": "BIM and ACC Project Management",
      "descripcion": "I developed a web system using PHP (without frameworks), HTML, MySQL, CSS, and Bootstrap. I integrated Autodesk APIs to optimize project management in BIM 360 and ACC. This project was sold to an internal Amazon construction team.",
      "lista": [
        "User authentication with session control.",
        "Project visualization and key information management.",
        "Issue management and permissions for project access.",
        "Creation and tracking of trouble tickets in BIM 360 and ACC.",
        "User tracking to monitor activity and inactivity in Autodesk."
      ],
      "seguimiento": "The project evolved into a version built with React, TypeScript, and AWS, where I contributed as a collaborator.",
      "actualidad": "I’m still working on this internal company project and can provide contact details of the current team in charge.",
      "links": "",
      "imagen": "./images/project1.webp"
    },
    {
      "id": "3",
      "titulo": "Used Video Game Platform",
      "descripcion": "After developing my first app with what I had learned, I created this one to help classify second-hand items from marketplace platforms, which helped me buy, sell, and earn some extra income. Today, my main app is still in development, and I keep building new things all the time.",

      "lista": [
        "Integration with MercadoLibre APIs to display the latest updates on used video games.",
        "Implementation of MVC models for modular code structure.",
        "User authentication and role-based management.",
        "Token renewal and retrieval using cron jobs.",
        "Automated data extraction via cron jobs.",
        "Optimized pagination to load dynamic content based on requested pages.",
        "Admin panel to manage listings and users.",
        "Centralized error logging system to register and display errors in one place.",
        "Access control to site sections based on user roles.",
        "Responsive design optimized for mobile devices."
      ],
      "seguimiento": "MercadoLibre changed the requirements and restricted endpoints.",
      "actualidad": "On hold.",
      "links": "https://reusados.net",
      "imagen": "./images/reusados.webp"
    },
    {
      "id": "4",
      "titulo": "WordPress Migration",
      "descripcion": "I completed the full migration of two WordPress websites from one hosting provider to another, ensuring the transfer of files, database, and email accounts.",
      "lista": [
        "Backed up and restored the MySQL database and site files.",
        "Set up the environment on the new hosting, ensuring PHP and MySQL compatibility.",
        "Updated and adjusted domain and DNS settings.",
        "Recreated and configured email accounts on the new hosting, ensuring proper operation.",
        "Optimized site loading and server settings.",
        "Verified site and plugin functionality after migration.",
        "Implemented security measures to protect the site in its new location."
      ],
      "seguimiento": "",
      "actualidad": "",
      "links": [
        {
          "url": "https://sgtours.com.ar/",
          "texto": "https://sgtours.com.ar/"
        },
        {
          "url": "https://sentimendoza.com.ar/",
          "texto": "https://sentimendoza.com.ar/"
        }
      ],
      "imagen": "./images/saintgermain.webp"
    },
    {
      "id": "5",
      "titulo": "Affiliate Blog",
      "descripcion": "A blog dedicated to sharing personal experiences, with affiliate links and useful baby-related calculators. Built in React and using PrimeReact. A resource for current and future parents offering practical and valuable content.",
      "lista": [
        "Personal experiences in baby care and parenting.",
        "Affiliate links to recommended products.",
        "Useful tools like calculators for child well-being."
      ],
      "seguimiento": "",
      "actualidad": "",
      "links": [
        {
          "url": "https://parabebes.com.ar/",
          "texto": "https://parabebes.com.ar/"
        }
      ],
      "imagen": "./images/parabebes.webp"
    }
  ]
}
