{
  "titulo": "Projekte",
  "proyectosLista": [
    {
      "id": "1",
      "titulo": "Persönliches Portfolio",
      "descripcion": "Dieses Portfolio ist ein Projekt für sich. Abhängig davon, von wo aus du darauf zugreifst, passt der Kontext einen anderen Vorschlag für jeden Benutzer an. Probiere die untenstehenden Links aus und klicke darauf, um zu sehen, wie es je nach Quelle funktioniert.",
      "lista": [
        "Sprachkontext.",
        "Themenkontext.",
        "Anpassung des Inhalts je nach Tageszeit.",
        "PHP für einfache Formulare.",
        "Verwendung der Bibliotheken PrimeReact, PrimeCSS, PrimeIcons."
      ],
      "seguimiento": "Hat gerade erst begonnen.",
      "actualidad": "Es gibt immer neue Funktionen hinzuzufügen.",
      "links": [
        {
          "url": "https://sabatie.com.ar/",
          "texto": "Standard von URL"
        },
        {
          "url": "https://sabatie.com.ar/?source=linkedin",
          "texto": "Von einer formellen Seite"
        },
        {
          "url": "https://sabatie.com.ar/?source=facebook",
          "texto": "Von einem sozialen Netzwerk"
        }
      ],
      "imagen": "./images/portfolio.webp"
    },
    {
      "id": "2",
      "titulo": "Projektmanagement BIM und ACC",
      "descripcion": "Ich habe ein reines PHP-Websystem (ohne Frameworks) entwickelt, um Arbeitsabläufe in Autodesk BIM 360/ACC zu optimieren.",
      "lista": [
        "Benutzerauthentifizierung mit Sitzungssteuerung.",
        "Projektanzeige und Verwaltung wichtiger Informationen.",
        "Verwaltung von Issues und Berechtigungen für den Projektzugriff.",
        "Erstellung und Verfolgung von Trouble Tickets in BIM 360 und ACC.",
        "Benutzerüberwachung zur Kontrolle von Aktivität und Inaktivität in Autodesk."
      ],
      "seguimiento": "Unser Team verkaufte die Lösung an eine Unternehmensgruppe; ich habe an der Migration zu React/TypeScript/AWS als Mitarbeiter teilgenommen und pflege und verbessere derzeit die Produktionsversion.",
      "actualidad": "Ich habe gelernt, technische Kritik in schnelles Wachstum zu verwandeln, komplexe Systeme in Unternehmensumgebungen zu warten und die Bedeutung sauberer Architekturen zu schätzen (hart gelernt).",
      "links": [
        {
          "url": "",
          "texto": "Ich gebe Links nur auf Anfrage und mit Erlaubnis ihrer Eigentümer weiter, die damit kein Problem haben werden."
        }
      ],
      "imagen": "./images/project1.webp"
    },
    {
      "id": "3",
      "titulo": "Plattform für gebrauchte Videospiele",
      "descripcion": "Nachdem ich meine erste App mit dem Gelernten entwickelt hatte, erstellte ich diese App, um gebrauchte Artikel auf Second-Hand-Plattformen zu klassifizieren. So konnte ich kaufen, verkaufen und ein zusätzliches Einkommen generieren. Heute ist meine Haupt-App noch in Entwicklung, und ich entwickle ständig neue Ideen.",
      "lista": [
        "Integration mit den APIs von MercadoLibre, um die neuesten Angebote für gebrauchte Videospiele anzuzeigen.",
        "Implementierung von Modellen (MVC) zur modularen Strukturierung des Codes.",
        "Benutzerauthentifizierung und Rollenverwaltung.",
        "Token-Erneuerung und -Abruf über Cronjobs.",
        "Automatisierte Datenerfassung mit Cronjobs.",
        "Optimierte Paginierung für das Laden dynamischer Inhalte je nach angeforderter Seite.",
        "Administrationspanel zur Verwaltung von Beiträgen und Benutzern.",
        "Zentralisiertes Fehlerprotokollsystem zur Aufzeichnung und Anzeige von Fehlern an einem Ort.",
        "Zugriffskontrolle auf Website-Bereiche basierend auf Benutzerrollen.",
        "Responsives Design optimiert für Mobilgeräte."
      ],
      "seguimiento": "MercadoLibre hat die Anforderungen geändert und Endpunkte eingeschränkt, daher wartet die App auf eine Neuerfindung.",
      "actualidad": "Status: Stand by.",
      "links": "https://reusados.net",
      "imagen": "./images/reusados.webp"
    },
    {
      "id": "4",
      "titulo": "WordPress-Migration",
      "descripcion": "Ich habe die vollständige Migration von zwei WordPress-Websites von einem Hosting zum anderen durchgeführt und dabei die Übertragung von Dateien, Datenbanken und E-Mails sichergestellt.",
      "lista": [
        "Backup und Wiederherstellung der MySQL-Datenbank und der Website-Dateien.",
        "Konfiguration der Umgebung auf dem neuen Hosting unter Sicherstellung der Kompatibilität mit PHP und MySQL.",
        "Aktualisierung und Anpassung der Domain- und DNS-Einstellungen.",
        "Erstellung und Konfiguration von E-Mail-Konten im neuen Hosting mit funktionierender Einrichtung.",
        "Optimierung der Ladezeiten der Website und der Servereinstellungen.",
        "Überprüfung der Funktionalität der Website und der Plugins nach der Migration.",
        "Implementierung von Sicherheitsmaßnahmen zum Schutz der Website am neuen Standort."
      ],
      "seguimiento": "",
      "actualidad": "",
      "links": [
        {
          "url": "",
          "texto": ""
        },
        {
          "url": "",
          "texto": "Ich gebe Links nur auf Anfrage und mit Erlaubnis ihrer Eigentümer weiter, die damit kein Problem haben werden."
        }
      ],
      "imagen": "./images/saintgermain.webp"
    },
    {
      "id": "5",
      "titulo": "Affiliate-Blog",
      "descripcion": "Ein Blog, der persönliche Erfahrungen teilt, mit Affiliate-Links und nützlichen Rechnern für Babys. Nachdem ich die erste Version meines Portfolios erstellt hatte, wollte ich weitere Komponenten entwickeln und habe diese Seite gebaut. Es fehlt aber noch etwas Wichtiges (Zeit und Herz). Ich werde sie bald aktualisieren.",
      "lista": [
        "Persönliche Erfahrungen in der Kindererziehung und -pflege.",
        "Affiliate-Links zu empfohlenen Produkten.",
        "Nützliche Tools wie Rechner für das Wohlbefinden von Kindern."
      ],
      "seguimiento": "",
      "actualidad": "Status: Stand by.",
      "links": [
        {
          "url": "https://parabebes.com.ar/",
          "texto": "https://parabebes.com.ar/"
        }
      ],
      "imagen": "./images/parabebes.webp"
    },
    {
      "id": "6",
      "titulo": "Virtuelle Karten ohne Registrierung",
      "descripcion": "Ein Generator mit der Möglichkeit, Vorlagen zu bearbeiten oder von Grund auf neu zu erstellen, einen Link zu generieren und ohne Registrierung zu teilen. Nur wenige Klicks und die Karte ist fertig.",
      "lista": [
        "Entwickelt mit React + Vite für hohe Leistung.",
        "Verwendung von PrimeReact und PrimeCSS für Oberfläche und Styling.",
        "Internationalisierung mit react-i18next für mehrere Sprachen.",
        "Zustandsverwaltung mit Context API.",
        "Link-Generierung und Backend mit Laravel (PHP).",
        "Animate.CSS für Textanimationen."
      ],
      "seguimiento": "Gerade erst angefangen.",
      "actualidad": "",
      "links": [
        {
          "url": "https://tarjetagratis.com/",
          "texto": "https://tarjetagratis.com/"
        }
      ],
      "imagen": "./images/tarjetagratis.png"
    }
  ]
}
