{
  "titulo": "Projekte",
  "proyectosLista": [
    {
      "titulo": "Persönliches Portfolio",
      "descripcion": "Dieses Portfolio ist ein eigenständiges Projekt. Je nachdem, von wo aus du darauf zugreifst, passt sich der Kontext an und bietet jedem Benutzer ein individuelles Erlebnis. Probiere es aus, indem du auf die untenstehenden Links klickst, um zu sehen, wie es sich je nach Quelle verhält.",
      "lista": [
        "Sprachkontext.",
        "Design-/Themenkontext.",
        "Inhaltsanpassung je nach Tageszeit.",
        "PHP für einfache Formulare.",
        "Verwendung der Bibliotheken PrimeReact, PrimeCSS und PrimeIcons."
      ],
      "seguimiento": "Gerade erst angefangen.",
      "actualidad": "Es gibt immer etwas Neues hinzuzufügen.",
      "links": [
        {
          "url": "https://sabatie.com.ar/",
          "texto": "Standard über URL"
        },
        {
          "url": "https://sabatie.com.ar/?source=linkedin",
          "texto": "Von einer formellen Website"
        },
        {
          "url": "https://sabatie.com.ar/?source=facebook",
          "texto": "Von einem sozialen Netzwerk"
        }
      ],
      "imagen": "./images/portfolio.webp"
    },
    {
      "id": "2",
      "titulo": "BIM- und ACC-Projektmanagement",
      "descripcion": "Ich entwickelte ein Websystem mit PHP (ohne Frameworks), HTML, MySQL, CSS und Bootstrap. Ich integrierte die Autodesk-APIs, um das Projektmanagement in BIM 360 und ACC zu optimieren. Dieses Projekt wurde an ein internes Amazon-Team im Bauwesen verkauft.",
      "lista": [
        "Benutzerauthentifizierung mit Sitzungssteuerung.",
        "Projektanzeige und Verwaltung wichtiger Informationen.",
        "Verwaltung von Issues und Zugriffsberechtigungen für Projekte.",
        "Erstellung und Nachverfolgung von Trouble Tickets in BIM 360 und ACC.",
        "Benutzerüberwachung zur Kontrolle von Aktivität und Inaktivität bei Autodesk."
      ],
      "seguimiento": "Das Projekt wurde weiterentwickelt zu einer Version mit React, TypeScript und AWS, bei der ich als Mitwirkender beteiligt war.",
      "actualidad": "Ich arbeite weiterhin an diesem internen Projekt des Unternehmens und kann den Kontakt zur aktuellen verantwortlichen Gruppe bereitstellen.",
      "links": "",
      "imagen": "./images/project1.webp"
    },
    {
      "id": "3",
      "titulo": "Plattform für Gebrauchte Videospiele",
      "descripcion": "Ich entwickelte eine Website mit PHP (ohne Frameworks), HTML, MySQL, CSS und Bootstrap, die auf den Kauf und Verkauf von gebrauchten Videospielen ausgerichtet ist.",
      "lista": [
        "Integration der MercadoLibre-APIs zur Anzeige der neuesten Informationen über gebrauchte Videospiele.",
        "Implementierung von MVC-Modellen zur modularen Strukturierung des Codes.",
        "Benutzerauthentifizierung und Rollenverwaltung.",
        "Token-Erneuerung und -Abruf mittels Cron-Jobs.",
        "Automatisierte Datenerfassung mit Cron-Jobs.",
        "Optimierte Seitennummerierung für dynamisches Laden je nach aufgerufener Seite.",
        "Administrationspanel zur Verwaltung von Anzeigen und Benutzern.",
        "Zentralisiertes Fehlerprotokollsystem zur Erfassung und Anzeige aller Fehler an einem Ort.",
        "Zugriffskontrolle auf verschiedene Bereiche der Website basierend auf Benutzerrollen.",
        "Responsives Design, das für Mobilgeräte optimiert ist."
      ],
      "seguimiento": "MercadoLibre hat die Anforderungen geändert und Endpunkte eingeschränkt.",
      "actualidad": "Wartet.",
      "links": "https://reusados.net",
      "imagen": "./images/reusados.webp"
    },
    {
      "id": "4",
      "titulo": "WordPress-Migration",
      "descripcion": "Ich führte die vollständige Migration von zwei WordPress-Websites von einem Hosting-Anbieter zu einem anderen durch und stellte die Übertragung von Dateien, Datenbanken und E-Mail-Konten sicher.",
      "lista": [
        "Sicherung und Wiederherstellung der MySQL-Datenbank und Website-Dateien.",
        "Einrichtung der Umgebung beim neuen Hosting-Anbieter unter Beachtung der Kompatibilität mit PHP und MySQL.",
        "Aktualisierung und Anpassung der Domain- und DNS-Einstellungen.",
        "Wiederherstellung und Konfiguration von E-Mail-Konten im neuen Hosting mit Funktionsprüfung.",
        "Optimierung der Ladegeschwindigkeit und Servereinstellungen.",
        "Funktionsprüfung der Website und Plugins nach der Migration.",
        "Implementierung von Sicherheitsmaßnahmen zum Schutz der Website an ihrem neuen Standort."
      ],
      "seguimiento": "",
      "actualidad": "",
      "links": [
        {
          "url": "https://sgtours.com.ar/",
          "texto": "https://sgtours.com.ar/"
        },
        {
          "url": "https://sentimendoza.com.ar/",
          "texto": "https://sentimendoza.com.ar/"
        }
      ],
      "imagen": "./images/saintgermain.webp"
    },
    {
      "id": "5",
      "titulo": "Affiliate-Blog",
      "descripcion": "Ein Blog, der persönliche Erfahrungen teilt, mit Affiliate-Links und nützlichen Baby-Rechnern. Entwickelt mit React und PrimeReact. Eine hilfreiche Ressource für Eltern und werdende Eltern mit praxisnahen Inhalten.",
      "lista": [
        "Persönliche Erfahrungen rund um die Kindererziehung.",
        "Affiliate-Links zu empfohlenen Produkten.",
        "Nützliche Tools wie Rechner für das Wohlbefinden von Kindern."
      ],
      "seguimiento": "",
      "actualidad": "",
      "links": [
        {
          "url": "https://parabebes.com.ar/",
          "texto": "https://parabebes.com.ar/"
        }
      ],
      "imagen": "./images/parabebes.webp"
    }
  ]
}
