{
  "titulo": "Proyectos",
  "proyectosLista": [
    {
      "id": "1",
      "titulo": "Portfolio personal",
      "descripcion": "Este portfolio es un proyecto en sí. Dependiendo desde dónde ingreses, el contexto adapta una propuesta distinta para cada usuario. Haz la prueba usando los enlaces que dejo más abajo y hacé clic en ellos para ver cómo funciona según el origen.",
      "lista": [
        "Contexto de idioma (Language context).",
        "Contexto de tema visual (Theme context).",
        "Adaptación del contenido según horarios del día.",
        "PHP para formularios básicos.",
        "Uso de las librerías PrimeReact, PrimeCSS, PrimeIcons."
      ],
      "seguimiento": "Recién comienza.",
      "actualidad": "Siempre hay funcionalidades nuevas por agregar.",
      "links": [
        {
          "url": "https://sabatie.com.ar/",
          "texto": "Default desde URL"
        },
        {
          "url": "https://sabatie.com.ar/?source=linkedin",
          "texto": "Desde un sitio formal"
        },
        {
          "url": "https://sabatie.com.ar/?source=facebook",
          "texto": "Desde una red social"
        }
      ],
      "imagen": "./images/portfolio.webp"
    },
    {
      "id": "2",
      "titulo": "Gestión de Proyectos BIM y ACC",
      "descripcion": "Desarrollé un sistema web en PHP puro (sin frameworks) para optimizar flujos de trabajo en Autodesk BIM 360/ACC.",
      "lista": [
        "Autenticación de usuarios con control de sesiones.",
        "Visualización de proyectos y gestión de información clave.",
        "Administración de issues y permisos para acceso a proyectos.",
        "Creación y seguimiento de trouble tickets en BIM 360 y ACC.",
        "Seguimiento de usuarios para monitorear actividad e inactividad en Autodesk."
      ],
      "seguimiento": "Nuestro equipo vendió la solución a un grupo corporativo; participé en la migración a React/TypeScript/AWS como colaborador y actualmente mantengo y mejoro la versión en producción.",
      "actualidad": "Aprendí a transformar críticas técnicas en crecimiento acelerado, mantener sistemas complejos en entornos empresariales y la importancia de arquitecturas limpias (aprendido en carne propia).",
      "links": [
        {
          "url": "",
          "texto": "No incluyo enlaces, solo a pedido y con permiso de sus dueños, los cuales no tendrán problema."
        }
      ],
      "imagen": "./images/project1.webp"
    },
    {
      "id": "3",
      "titulo": "Plataforma de Videojuegos Usados",
      "descripcion": "Luego de desarrollar mi primera app con lo que había aprendido, hice esta app que me sirvió para clasificar artículos usados en plataformas de segunda mano, lo cual me ayudó a comprar, vender y generar un ingreso extra. Hoy en día, mi app principal sigue en desarrollo y continúo creando cosas nuevas constantemente.",
      "lista": [
        "Integración con las APIs de MercadoLibre para mostrar las últimas novedades en videojuegos usados.",
        "Implementación de modelos (MVC) para estructurar el código de forma modular.",
        "Autenticación y gestión de usuarios con control de roles.",
        "Renovación y obtención de tokens mediante cron jobs.",
        "Extracción automatizada de datos con cron jobs.",
        "Paginación optimizada para cargar contenido dinámico según la página solicitada.",
        "Panel de administración para gestionar publicaciones y usuarios.",
        "Sistema de error logging centralizado, registrando y mostrando errores en un solo lugar.",
        "Control de acceso a secciones del sitio basado en roles de usuario.",
        "Diseño responsivo y optimizado para dispositivos móviles."
      ],
      "seguimiento": "MercadoLibre cambió los requerimientos y restringió endpoints, por lo cual la app quedó a la espera de que la reinvente.",
      "actualidad": "Estado: Stand by.",
      "links": "https://reusados.net",
      "imagen": "./images/reusados.webp"
    },
    {
      "id": "4",
      "titulo": "Migración de WordPress",
      "descripcion": "Realicé la migración completa de dos sitios web en WordPress desde un hosting a otro, asegurando la transferencia de archivos, base de datos y correos electrónicos.",
      "lista": [
        "Respaldé y restauré la base de datos MySQL y los archivos del sitio.",
        "Configuré el entorno en el nuevo hosting, asegurando compatibilidad con PHP y MySQL.",
        "Actualicé y ajusté la configuración del dominio y DNS.",
        "Recreé y configuré cuentas de correo en el nuevo hosting, asegurando su correcto funcionamiento.",
        "Optimicé la carga del sitio y configuraciones del servidor.",
        "Verifiqué la funcionalidad del sitio y los plugins tras la migración.",
        "Implementé medidas de seguridad para proteger el sitio en su nueva ubicación."
      ],
      "seguimiento": "",
      "actualidad": "",
      "links": [
        {
          "url": "",
          "texto": ""
        },
        {
          "url": "",
          "texto": "No incluyo enlaces, solo a pedido y con permiso de sus dueños, los cuales no tendrán problema."
        }
      ],
      "imagen": "./images/saintgermain.webp"
    },
    {
      "id": "5",
      "titulo": "Blog con Afiliados",
      "descripcion": "Un blog dedicado a compartir experiencias personales, con enlaces de afiliados y calculadoras útiles para bebés. Después de crear la primera versión de mi portfolio quise continuar creando componentes y creé este sitio, pero le falta algo importante (tiempo y alma). Pronto lo actualizaré.",
      "lista": [
        "Experiencias personales en la crianza y cuidado de bebés.",
        "Enlaces de afiliados a productos recomendados.",
        "Herramientas útiles como calculadoras para el bienestar infantil."
      ],
      "seguimiento": "",
      "actualidad": "Estado: Stand by.",
      "links": [
        {
          "url": "https://parabebes.com.ar/",
          "texto": "https://parabebes.com.ar/"
        }
      ],
      "imagen": "./images/parabebes.webp"
    }
  ]
}
